[["speedy gonzales.1955", {"roles": [{"role": "Speedy Gonzales/Sylvester/Various Mice", "gender": "M"}], "version": "I", "year": "1955", "title": "Speedy Gonzales", "id": 91138, "num_ratings": "1218", "ratings": "7.4", "summaries_wikipedia": ["The short opens on a small, white-shirted, worried group of mice wearing sombreros thinking of how to get cheese from the AJAX cheese factory across the Mexican-American border that is guarded by Sylvester the Cat. Sylvester has eaten other mice who have tried. The leader comes up with a brilliant idea: retain the services of the aptly named \"Speedy Gonzales\". The group agrees, so the leader goes to the carnival where Speedy resides. Speedy Gonzales is at the carnival attraction \"Shoot Speedy\" in which people try to shoot Speedy with bullets from a gun in order to \"win a beeg prize.\" The leader tells Speedy, in Spanish, about the dire situation the mice are in, not having access to the cheese guarded by Sylvester. Speedy agrees. Speedy runs through the wire field between the mice and Sylvester shaking his legs as he yells \"Â¡Ã\u0081ndale! Â¡Ã\u0081ndale! Â¡Arriba! Â¡Arriba!,\" and runs past Sylvester, gets into the cheese factory and brings back a round of cheese. Sylvester then throws a baseball at the AJAX cheese factory, but it turns out Speedy is inside the baseball, and therefore able to get even more cheese from Sylvester to the mice. Sylvester then tries using landmines and mousetraps, to no avail. Finally, Sylvester gets fed up with Speedy's agility and evasive maneuvers and gets all the cheese from the factory and stacks them up . Sylvester uses a bomb to blow up all the cheese but the cheese boxes only explode, and much of the cheese lands where the mice are, causing Sylvester to cry and bang his head on an electric pole in annoyance. Speedy then says \"I like this pussycat fellow; he's silly!\" and the short ends."], "venue": "T", "language": null, "summaries_imdb": ["Starving Mexican mice want access to a cheese factory guarded by Sylvester Cat and send for Speedy Gonzales, the fastest mouse in all Mexico, to breeze past Sylvester and obtain the cheese for them."]}], ["the best of enemies.1961", {"roles": [{"role": "Capt. Rootes", "gender": "M"}, {"role": "Pvt. Mattone", "gender": "M"}, {"role": "Col. Brownlow", "gender": "M"}, {"role": "Pvt. Singer", "gender": "M"}, {"role": "Sentinel", "gender": "M"}, {"role": "Sgt. Spadoni", "gender": "M"}, {"role": "Lt. Thomlinson", "gender": "M"}, {"role": "Perfect", "gender": "M"}, {"role": "Sgt. Todini", "gender": "M"}, {"role": "Lt. Hilary", "gender": "M"}, {"role": "Sgt. Trevethan", "gender": "M"}, {"role": "Cpl. Bortolini", "gender": "M"}, {"role": "Pvt. Moccia", "gender": "M"}, {"role": "Maj. Fornari", "gender": "M"}, {"role": "Sub. Lt. Del Pra", "gender": "M"}, {"role": "Maj. Richardson", "gender": "M"}, {"role": "Bernasconi", "gender": "M"}, {"role": "Capt. Blasi", "gender": "M"}, {"role": "Col. Brownhow", "gender": "M"}, {"role": "Lt. Burke", "gender": "M"}], "version": "I", "year": "1961", "title": "The Best of Enemies", "id": 97383, "num_ratings": "397", "ratings": "6.9", "summaries_wikipedia": [], "venue": "T", "language": null, "summaries_imdb": ["In 1941 the Italian and British forces face one another.Italian army Captain Blasi and his troops capture a British army Major Richardson and his pilot when their scout plane crashes. The Italians allow the two British prisoners to escape. A desperate Captain Blasi decides to allow Major Richardson escape in return for Richardson's word that he will try and persuade his superiors to allow Captain Blasi and his Italian unit retreat without any difficulties or further harassment. O his return the British major is assigned to take his squadron and attack the fort his captors were retreating to. the British Major with a superior British unit takes Captain Blasi and his men prisoner but they slip away. the British abandon their vehicles to give chase on foot and the Native troops with the Italians slip back and burn the vehicles. the fire results in both the British and Italian troops seeking refuge on an island in the middle of a lake. The Italians surrender to the British so they will get taken care of."]}]]